Revit 2026 API

# DividedSurfaceIsComponentFlipped Property

---

Whether the pattern is flipped.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsComponentFlipped { get; set; }
```
```vb
Public Property IsComponentFlipped As Boolean
	Get
	Set
```
```cpp
public:
property bool IsComponentFlipped {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsComponentFlipped : bool with get, set
```

#### Property Value

Boolean

This property has no effect unless a pattern is selected (the ObjectType property is not ). Changing this flag effectively reflects the component through its XY-plane, which is equivalent to reflecting it through the original surface.

#### Reference

DividedSurface Class

Autodesk.Revit.DB Namespace